import re
from bs4 import BeautifulSoup

SECTION_DUTIES_NAMES = (
    r'Какие задачи тебя ждут[?:]?[\n]|Круг задач[?:]?[\n]|Верхнеуровневое описание задач[?:]?[\n]|Задачи, которые тебе нужно будет решить[?:]?[\n]|'
    r'Подробнее о задачах[?:]?[\n]|Ваши задачи[?:]?[\n]|Задачи, которые мы предлагаем[?:]?[\n]|Задача[?:]?[\n]|'
    r'Основные задачи и зоны ответственности[?:]?[\n]|Основные задачи[?:]?[\n]|Задачи[?:]?[\n]|В твои задачи будет входить[?:]?[\n]|'
    r'Вы будете[?:]?[\n]|Что необходимо будет делать[?:]?[\n]|Что нужно будет делать[?:]?[\n]|Что надо будет делать[?:]?[\n]|Что будете делать[?:]?[\n]|Что ты будешь делать[?:]?[\n]|'
    r'Что нужно делать[?:]?[\n]|Что вы будете делать[?:]?[\n]|Вы будете заниматься[?:]?[\n]|'
    r'Чем заниматься[?:]?[\n]|Чем вы займетесь[?:]?[\n]|Чем необходимо заниматься[?:]?[\n]|'
    r'Чем предстоит заниматься[?:]?[\n]|Что предстоит делать[?:]?[\n]|Тебе предстоит[?:]?[\n]|Вам предстоит[?:]?[\n]|'
    r'В обязанности входит[?:]?[\n]|Обязанности[?:]?[\n]|В ваши обязанности входит[?:]?[\n]|'
    r'Функциональные обязанности[?:]?[\n]|Основной функционал[?:]?[\n]|'
    r'Должностные обязанности[?:]?[\n]|Основные обязанности[?:]?[\n]|'
    r'Обязанности преподавателя[?:]?[\n]|Что делает наставник[?:]?[\n]|Что делает автор[?:]?[\n]|'
    r'Следующих компонентов[?:]?[\n]|задачи для вас[?:]?[\n]'
)

SECTION_REQUIREMENTS_NAMES = (
    r'Мы жд[её]м от тебя[?:]?[\n]|Мы ожидаем от будущего члена команды[?:]?[\n]|Что мы ожидаем от вас[?:]?[\n]|Что мы жд[её]м от кандидата[?:]?[\n]|Мы жд[её]м от кандидата[?:]?[\n]|Мы жд[её]м тебя, если[?:]?[\n]|'
    r'Что мы жд[её]м от кандидатов[?:]?[\n]|Что мы жд[её]м[?:]?[\n]|Что ожидаем от вас[?:]?[\n]|От вас жд[её]м[?:]?[\n]|Мы жд[её]м, что вы имеете опыт[?:]?[\n]|Мы жд[её]м от вас[?:]?[\n]|Какие у нас ожидания от кандидата[?:]?[\n]|'
    r'жд[её]м, что ты[?:]?[\n]|Мы жд[её]м, что ты[?:]?[\n]|Что мы жд[её]м от Вас[?:]?[\n]|Что мы жд[её]м от тебя[?:]?[\n]|Что жд[её]м от соискателя[?:]?[\n]|От будущего коллеги мы жд[её]м[?:]?[\n]|'
    r'Какие наши требования к кандидату[?:]?[\n]|Требования к кандидатам[?:]?[\n]|Требования к компетенциям и опыту[?:]?[\n]|Обязательные требования[?:]?[\n]|Требования:?[\n]|Мы жд[её]м от будущих коллег[?:]?[\n]|'
    r'Технические требования[?:]?[\n]|Требования и навыки[?:]?[\n]|Требования к кандидату[?:]?[\n]|Профессиональные требования[?:]?[\n]|Ключевые требования[?:]?[\n]|'
    r'Обязанности искомого специалиста и ожидаемые результаты работы[?:]?[\n]|Мы ищем кандидата, который соответствует следующим требованиям[?:]?[\n]|'
    r'Требуется понимание принципов ООП и владение следующими технологиями[?:]?[\n]|Требования к соискателю[?:]?[\n]|Также потребуются[?:]?[\n]|'
    r'Ожидания[?:]?[\n]|Наши ожидания[?:]?[\n]|Что мы ожидаем от кандидата[?:]?[\n]|Ожидаем от тебя[?:]?[\n]|'
    r'Наши ожидания от кандидата[?:]?[\n]|Мы ожидаем[?:]?[\n]|Ожидания от кандидата [(]опционально[)][?:]?[\n]|Мы ожидаем уверенные знания[?:]?[\n]|'
    r'Что мы ожидаем[?:]?[\n]|Что мы ожидаем от кандидата[?:]?[\n]|Ожидания от кандидата[?:]?[\n]|'
    r'Нам важно[?:]?[\n]|Для нас важно[?:]?[\n]|В вашем опыте для нас важно[?:]?[\n]|Что для нас важно[?:]?[\n]|Ключевые знания[?:]?[\n]|'
    r'Твоя суперсила[?:]?[\n]|Мы ищем кандидата, который обладает[?:]?[\n]|Специальные навыки и знания[?:]?[\n]|'
    r'Какой опыт нам важен[?:]?[\n]|Необходимые навыки и опыт[?:]?[\n]|Какие знания и навыки нам важны[?:]?[\n]|Необходимые навыки[?:]?[\n]|'
    r'Необходимо иметь[?:]?[\n]|Пожелания к соискателю[?:]?[\n]|Пожелания к кандидату[?:]?[\n]|Что нужно знать и уметь[?:]?[\n]|'
    r'Знания и навыки[?:]?[\n]|Обязательные навыки[?:]?[\n]|Ты идеальный кандидат, если у тебя есть[?:]?[\n]|Опыт и навыки[?:]?[\n]|Необходимые знания[?:]?[\n]|Требуемые навыки[?:]?[\n]|'
    r'Ваш профиль[?:]?[\n]|Желательно[?:]?[\n]|у Вас есть[?:]?[\n]|Потребуется[?:]?[\n]|'
    r'Что хотим[?:]?[\n]|Что мы хотим видеть от Вас[?:]?[\n]|Что мы хотим увидеть[?:]?[\n]|'
    r'Вы точно нам подходите, если вы уверенный специалист хотя бы в одной из этих областей[?:]?[\n]|Вы нам подходите, если[?:]?[\n]|'
    r'Наши пожелания[?:]?[\n]|Мы сработаемся, если есть[?:]?[\n]|'
    r'От вас нужно[?:]?[\n]|Мы ищем кандидата, который[?:]?[\n]|'
    r'Мы подходим друг другу если у тебя есть[?:]?[\n]|Что команде хотелось бы видеть[?:]?[\n]|'
    r'Квалификация[?:]?[\n]|Наш кандидат должен иметь[?:]?[\n]|Каким мы представляем нашего будущего коллегу[?:]?[\n]|'
    r'Наши пожелания к квалификации[?:]?[\n]|Обязательные[?:]?[\n]|Мы абсолютно уверены, что ты справишься, ведь ты[?:]?[\n]'
)

KEYWORDS_END_OF_SECTIONS = (
    r'Технологический стек[?:]?[\n]|Наш стек[?:]?[\n]|Основной стек[?:\n]?|Стек технологий[?:]?[\n]|Мы используем современные инструменты[?:]?[\n]|'
    r'У нас[?:\n]?|Формат[?:\n]?|С нами классно работать[?:\n]?|Для разработки мы используем[?:]?[\n]|'
    r'Что ты получишь[?:\n]?|Круто, если ты[?:\n]?|Мы можем предложить[?:\n]?|Почему[?:\n]|Что мы предлагаем[?:]?[\n]|'
    r'С чем ещё мы работаем[?:\n]?|Что предлагаем[?:\n]?|Еще несколько причин, почему именно мы[?:\n]?|'
    r'Что тебя ждёт в[?:\n]?|Ближайшие задачи[?:\n]?|Наши технологии[?:\n]?|Что компания может предложить[?:\n]?|'
    r'Что надо будет делать[?:\n]?|Какие вещи и технологии мы используем в работе[?:\n]?|Что мы готовы предложить[?:\n]?|С нас[?:\n]?|'
    r'Мы ожидаем уверенные знания[?:\n]?|Условия[?:]?[\n]|Наши условия[?:\n]?|Условия работы[?:\n]?|Про команду и рабочие процессы|вас ждет|'
    r'В сопроводительном письме[?:\n]?|Почему стоит выбрать нас[?:\n]?|Условия[?:\n]?|Вы гарантированно получите[?:\n]?|Что ждать от нас[?:\n]?|'
    r'Предлагаем[?:\n]?|Мы предлагаем[?:\n]?|Что вас ждет после успешного обучения[?:\n]?|Процесс поиска[?:\n]?|Что мы готовы вам предложить[?:\n]?|В .* вас ждет[?:\n]?|'
    r'Знание технологий[?:\n]?|Архитектура и инфраструктура[?:\n]?|Глубокие технические компетенции[?:]?|Что мы можем предложить[?:]?[\n]|Работа у нас - это[?:]?[\n]|Этапы входа в компанию[?:]?[\n]|P.S.[\n]'
)

def extract_duties_and_requirements_by_keywords(text):
    text = text.replace('<strong>', '').replace('</strong>', '').replace('<em>', '').replace('</em>', '').replace('<span>', '').replace('</span>', '').replace(';', '').replace('·', '').replace('●', '').replace('—', '').replace('✔️', '').replace('✅', '').replace('⭐️', '')
    soup = BeautifulSoup(text, 'html.parser')
    text = soup.get_text(separator='\n', strip=True)

    def extract_section(header_pattern, text, end_pattern):
        match = re.search(header_pattern + r'([\s\S]*?)(?=' + end_pattern + r'|$)', text, re.IGNORECASE | re.DOTALL)
        if match:
            return match.group(1).strip()
        return None

    duties = extract_section(r'(?:' + SECTION_DUTIES_NAMES + r')', text, r'\n(?:' + SECTION_REQUIREMENTS_NAMES + r'|' + KEYWORDS_END_OF_SECTIONS + r')')
    requirements = extract_section(r'(?:' + SECTION_REQUIREMENTS_NAMES + r')', text, r'\n(?:' + SECTION_DUTIES_NAMES + r'|' + KEYWORDS_END_OF_SECTIONS + r')')

    def extract_items(section_text):
        if not section_text:
            return []
        items = []
        for item in re.split(r'[•\n]', section_text):
            if item.strip() and item != '\u200b':
                if item[0] in '-*':
                    symb = item[0]
                    item_with_removed_dash_at_start = item.strip().replace(symb, '', 1)
                    items.append(item_with_removed_dash_at_start)
                else:
                    items.append(item.strip())
        return items

    result = {
        'duties': extract_items(duties) if duties else [],
        'requirements': extract_items(requirements) if requirements else []
    }

    return result