import re
from bs4 import BeautifulSoup

SECTION_DUTIES_NAMES = (
    r'Следующих компонентов[?:]?[\n]|Вы будете[?:]?[\n]|Какие задачи тебя ждут[?:]?[\n]|'
    r'Тебе предстоит[?:]?[\n]|Что необходимо будет делать[?:]?[\n]|Чем вы займетесь[?:]?[\n]|Чем необходимо заниматься[?:]?[\n]|'
    r'Что предстоит делать[?:]?[\n]|Круг задач[?:]?[\n]|Верхнеуровневое описание задач[?:]?[\n]|'
    r'Основные задачи и зоны ответственности[?:]?[\n]|Подробнее о задачах[?:]?[\n]|Чем заниматься[?:]?[\n]|'
    r'Чем предстоит заниматься[?:]?[\n]|Задачи[?:]?[\n]|Что нужно будет делать[?:]?[\n]|Что нужно делать[?:]?[\n]|В обязанности входит[?:]?[\n]|'
    r'Что надо будет делать[?:]?[\n]|Основные задачи[?:]?[\n]|вы будете заниматься[?:]?[\n]|Задачи, которые мы предлагаем[?:]?[\n]|'
    r'Обязанности[?:]?[\n]|Функциональные обязанности[?:]?[\n]|Что вы будете делать[?:]?[\n]|Основной функционал[?:]?[\n]|'
    r'Ваши задачи[?:]?[\n]|Должностные обязанности[?:]?[\n]|Основные обязанности[?:]?[\n]|'
    r'В ваши обязанности входит[?:]?[\n]|Задача[?:]?[\n]|Вам предстоит[?:]?[\n]|Обязанности преподавателя[?:]?[\n]|Что делает наставник[?:]?[\n]|Что делает автор[?:]?[\n]'
)

SECTION_REQUIREMENTS_NAMES = (
    r'Мы ждем от тебя[?:]?[\n]|Мы ожидаем от будущего члена команды[?:]?[\n]|Что мы ждём от кандидата[?:]?[\n]|Необходимые знания[?:]?[\n]|Что мы ожидаем от вас[?:]?[\n]|'
    r'Нам важно[?:]?[\n]|Твоя суперсила[?:]?[\n]|Что мы ожидаем от кандидата[?:]?[\n]|Мы ищем кандидата, который обладает[?:]?[\n]|'
    r'Ждем, что ты[?:]?[\n]|Какие наши требования к кандидату\?[\n]|Необходимо иметь[?:]?[\n]|Пожелания к соискателю[?:]?[\n]|'
    r'Ожидаем от тебя[?:]?[\n]|Что хотим[?:]?[\n]|Какой опыт нам важен[?:]?[\n]|Необходимые навыки и опыт[?:]?[\n]|Знания и навыки[?:]?[\n]|'
    r'Что ждём от соискателя[?:]?[\n]|Наши ожидания от кандидата[?:]?[\n]|В вашем опыте для нас важно[?:]?[\n]|Требования к компетенциям и опыту[?:]?[\n]|'
    r'Обязательные навыки[?:]?[\n]|Ваш профиль[?:]?[\n]|Мы ждём, что ты[?:]?[\n]|Ты идеальный кандидат, если у тебя есть[?:]?[\n]|'
    r'Ожидания[?:]?[\n]|Наши ожидания[?:]?[\n]|у Вас есть[?:]?[\n]|Что мы ждем от Вас[?:]?[\n]|Вы нам подходите, если[?:]?[\n]|Мы ожидаем[?:]?[\n]|'
    r'Вы точно нам подходите, если вы уверенный специалист хотя бы в одной из этих областей[?:]?[\n]|Что мы ждём от тебя[?:]?[\n]|Какие знания и навыки нам важны[?:]?[\n]|'
    r'Наши пожелания[?:]?[\n]|Мы ожидаем уверенные знания[?:]?[\n]|Что для нас важно[?:]?[\n]|Технические требования[?:]?[\n]|Мы сработаемся, если есть[?:]?[\n]|'
    r'Что мы ожидаем от кандидата[?:]?[\n]|От вас нужно[?:]?[\n]|Мы ищем кандидата, который[?:]?[\n]|Требуется понимание принципов ООП и владение следующими технологиями[?:]?[\n]|'
    r'Обязательные требования[?:]?[\n]|Требования:?[\n]|Желательно[?:]?[\n]|Ожидания от кандидата[?:]?[\n]|Ожидания от кандидата [(]опционально[)][?:]?[\n]|'
    r'Требования и навыки[?:]?[\n]|Что мы ожидаем[?:]?[\n]|Требования к кандидату[?:]?[\n]|Что мы хотим видеть от Вас[?:]?[\n]|Мы подходим друг другу если у тебя есть[?:]?[\n]|'
    r'Квалификация[?:]?[\n]|Необходимые навыки[?:]?[\n]|Опыт и навыки[?:]?[\n]|Наш кандидат должен иметь[?:]?[\n]|Каким мы представляем нашего будущего коллегу[?:]?[\n]|'
    r'Профессиональные требования[?:]?[\n]|Ключевые требования[?:]?[\n]|Мы ждём от вас[?:]?[\n]|Ожидания[?:]?[\n]|От будущего коллеги мы ждем[?:]?[\n]|Наши пожелания к квалификации[?:]?[\n]|'
    r'Требования к соискателю[?:]?[\n]|Что мы ждём от кандидатов[?:]?[\n]|Что ожидаем от вас[?:]?[\n]|От вас ждем[?:]?[\n]|Мы ждем, что вы имеете опыт[?:]?[\n]|Что мы хотим увидеть[?:]?[\n]'
)
KEYWORDS_END_OF_SECTIONS = (
    r'Наш стек[?:\n]?|Желательно[?:\n]?|У нас[?:\n]?|Формат[?:\n]?|С нами классно работать[?:\n]?|'
    r'Что ты получишь[?:\n]?|Круто, если ты[?:\n]?|Мы можем предложить[?:\n]?|Почему|Наш стек[?:\n]?|Что мы предлагаем[?:\n]?|'
    r'С чем ещё мы работаем[?:\n]?|Стек технологий[?:\n]?|Что предлагаем[?:\n]?|Еще несколько причин, почему именно мы[?:\n]?|'
    r'Что тебя ждёт в[?:\n]?|Технологический стек​​​​​[?:\n]?|Ближайшие задачи[?:\n]?|Основной стек[?:\n]?|Наши технологии[?:\n]?|'
    r'Что надо будет делать[?:\n]?|Какие вещи и технологии мы используем в работе[?:\n]?|Что мы готовы предложить[?:\n]?|С нас[?:\n]?|'
    r'Мы ожидаем уверенные знания[?:\n]?|Условия[?:\n]?|Наши условия[?:\n]?|Условия работы[?:\n]?|Про команду и рабочие процессы|'
    r'В сопроводительном письме[?:\n]?|Что мы дадим взамен.*|Почему стоит выбрать нас[?:\n]?|Условия[?:\n]?|Вы гарантированно получите[?:\n]?|'
    r'Предлагаем[?:\n]?|Мы предлагаем[?:\n]?|Что вас ждет после успешного обучения[?:\n]?|Процесс поиска[?:\n]?|Что мы готовы вам предложить:[?:\n]?|'
    r'Знание технологий[?:\n]?|Архитектура и инфраструктура[?:\n]?|Глубокие технические компетенции[?:]?[\n]'
)

def extract_duties_and_requirements_by_keywords(text):
    text = text.replace('<strong>', '').replace('</strong>', '').replace('<em>', '').replace('</em>', '').replace('<span>', '').replace('</span>', '').replace(';', '').replace('·', '').replace('—', '').replace('✔️', '').replace('⭐️', '')
    soup = BeautifulSoup(text, 'html.parser')
    text = soup.get_text(separator='\n', strip=True)

    def extract_section(header_pattern, text, end_pattern):
        match = re.search(header_pattern + r'([\s\S]*?)(?=' + end_pattern + r'|$)', text, re.IGNORECASE | re.DOTALL)
        if match:
            return match.group(1).strip()
        return None

    duties = extract_section(r'(?:' + SECTION_DUTIES_NAMES + r')', text, r'\n(?:' + SECTION_REQUIREMENTS_NAMES + r'|' + KEYWORDS_END_OF_SECTIONS + r')')
    requirements = extract_section(r'(?:' + SECTION_REQUIREMENTS_NAMES + r')', text, r'\n(?:' + SECTION_DUTIES_NAMES + r'|' + KEYWORDS_END_OF_SECTIONS + r')')

    def extract_items(section_text):
        if not section_text:
            return []
        items = []
        for item in re.split(r'[•\n]', section_text):
            if item.strip() and item != '\u200b':
                if item[0] in '-*':
                    symb = item[0]
                    item_with_removed_dash_at_start = item.strip().replace(symb, '', 1)
                    items.append(item_with_removed_dash_at_start)
                else:
                    items.append(item.strip())
        return items

    result = {
        'duties': extract_items(duties) if duties else [],
        'requirements': extract_items(requirements) if requirements else []
    }

    return result