import re

from bs4 import BeautifulSoup
import emoji



SECTION_DUTIES_NAMES = (
    r'Какие задачи тебя ждут[?:]?[\n]|Круг задач[?:]?[\n]|Верхнеуровневое описание задач[?:]?[\n]|Задачи, которые тебе нужно будет решить[?:]?[\n]|'
    r'Подробнее о задачах[?:]?[\n]|Ваши задачи[?:]?[\n]|Задачи, которые мы предлагаем[?:]?[\n]|Задача[?:]?[\n]|'
    r'Основные задачи и зоны ответственности[?:]?[\n]|Основные задачи[?:]?[\n]|Задачи[?:]?[\n]|В твои задачи будет входить[?:]?[\n]|'
    r'Чем будешь заниматься[?:]?[\n]|Чем будете заниматься[?:]?[\n]|Чем нужно будет заниматься[?:]?[\n]|Чем тебе предстоит заниматься[?:]?[\n]|'
    r'Что тебе предстоит делать[?:]?[\n]|Ты будешь[?:]?[\n]|'
    r'Вы будете[?:]?[\n]|Что необходимо будет делать[?:]?[\n]|Что нужно будет делать[?:]?[\n]|Что надо будет делать[?:]?[\n]|Что будете делать[?:]?[\n]|Что ты будешь делать[?:]?[\n]|'
    r'Что нужно делать[?:]?[\n]|Что вы будете делать[?:]?[\n]|Вы будете заниматься[?:]?[\n]|Чем вам предстоит заниматься[?:]?[\n]|'
    r'Чем заниматься[?:]?[\n]|Чем вы займетесь[?:]?[\n]|Чем необходимо заниматься[?:]?[\n]|'
    r'Чем предстоит заниматься[?:]?[\n]|Что предстоит делать[?:]?[\n]|Тебе предстоит[?:]?[\n]|Вам предстоит[?:]?[\n]|В команде .* тебе предстоит[?:]?[\n]|'
    r'В обязанности входит[?:]?[\n]|Обязанности[?:]?[\n]|В ваши обязанности входит[?:]?[\n]|C чем нам потребуется помощь[?:]?[\n]|'
    r'Функциональные обязанности[?:]?[\n]|Основной функционал[?:]?[\n]|Основная задача[?:]?[\n]?|Ваша роль в компании[?:]?[\n]?|'
    r'Должностные обязанности[?:]?[\n]|Основные обязанности[?:]?[\n]|Что по задачам[?:]?[\n]|Какие задачи предстоит решать[?:]?[\n]|'
    r'Обязанности преподавателя[?:]?[\n]|Что делает наставник[?:]?[\n]|Что делает автор[?:]?[\n]|Что вас ждёт на обучении[?:]?[\n]|'
    r'Следующих компонентов[?:]?[\n]|задачи для вас[?:]?[\n]|Мы поручим[?:]?[\n]|Какие задачи предстоит выполнять[?:]?[\n]|Что тебя ждёт[?:]?[\n]|Тебе предстоит отвечать за[?:]?[\n]'
)

SECTION_REQUIREMENTS_NAMES = (
    r'Требования[?:]?[\n]|Мы жд[её]м от тебя[?:]?[\n]|Мы ожидаем от будущего члена команды[?:]?[\n]|Что мы ожидаем от вас[?:]?[\n]|Мы ожидаем от вас[?:]?[\n]|Что мы жд[её]м от кандидата[?:]?[\n]|Мы жд[её]м от кандидата[?:]?[\n]|Мы жд[её]м тебя, если[?:]?[\n]|'
    r'Что мы жд[её]м от кандидатов[?:]?[\n]|Что мы жд[её]м[?:]?[\n]|Что ожидаем от вас[?:]?[\n]|От вас жд[её]м[?:]?[\n]|Мы жд[её]м, что вы имеете опыт[?:]?[\n]|Мы жд[её]м от вас[?:]?[\n]|Какие у нас ожидания от кандидата[?:]?[\n]|'
    r'жд[её]м, что ты[?:]?[\n]|Мы жд[её]м, что ты[?:]?[\n]|Что мы жд[её]м от Вас[?:]?[\n]|Что мы жд[её]м от тебя[?:]?[\n]|Что жд[её]м от соискателя[?:]?[\n]|От будущего коллеги мы жд[её]м[?:]?[\n]|Что жд[её]м[?:]?[\n]|'
    r'Какие наши требования к кандидату[?:]?[\n]|Требования к кандидатам[?:]?[\n]|Требования к компетенциям и опыту[?:]?[\n]|Обязательные требования[?:]?[\n]|Мы жд[её]м от будущих коллег[?:]?[\n]|'
    r'Технические требования[?:]?[\n]|Требования и навыки[?:]?[\n]|Требования к кандидату[?:]?[\n]|Профессиональные требования[?:]?[\n]|Ключевые требования[?:]?[\n]|Мы ценим, если ты[?:]?[\n]|'
    r'Обязанности искомого специалиста и ожидаемые результаты работы[?:]?[\n]|Мы ищем кандидата, который соответствует следующим требованиям[?:]?[\n]|'
    r'Требования к backend-разработчику[?:]?[\n]|Мы подходим друг другу, если у вас есть[?:]?[\n]|Ваши ключевые навыки и опыт нам важны[?:]?[\n]|'
    r'Требуется понимание принципов ООП и владение следующими технологиями[?:]?[\n]|Требования к соискателю[?:]?[\n]|Также потребуются[?:]?[\n]|'
    r'Ожидания[?:]?[\n]|Наши ожидания[?:]?[\n]|Что мы ожидаем от кандидата[?:]?[\n]|Ожидаем от тебя[?:]?[\n]|Мы ожидаем, что Вы[?:]?[\n]|Мы ожидаем,что у тебя есть опыт[?:]?[\n]|'
    r'Наши ожидания от кандидата[?:]?[\n]|Мы ожидаем[?:]?[\n]|Ожидания .* от кандидата [(].*?[)][?:]?[\n]|Мы ожидаем уверенные знания[?:]?[\n]|'
    r'Что мы ожидаем[?:]?[\n]|Что мы ожидаем от кандидата[?:]?[\n]|Что ожидаем от кандидата[?:]?[\n]|Ожидания .* от кандидата[?:]?[\n]|'
    r'Нам важно[?:]?[\n]|Для нас важно[?:]?[\n]|Для нас важны[?:]?[\n]|В вашем опыте для нас важно[?:]?[\n]|Что для нас важно[?:]?[\n]|Ключевые знания[?:]?[\n]|'
    r'Твоя суперсила[?:]?[\n]|Мы ищем кандидата, который обладает[?:]?[\n]|Специальные навыки и знания[?:]?[\n]|Наши ожидания от тебя[?:]?[\n]|'
    r'Какой опыт нам важен[?:]?[\n]|Необходимые навыки и опыт[?:]?[\n]|Какие знания и навыки нам важны[?:]?[\n]|Необходимые навыки[?:]?[\n]|'
    r'Необходимо иметь[?:]?[\n]|Пожелания к соискателю[?:]?[\n]|Пожелания к кандидату[?:]?[\n]|Что нужно знать и уметь[?:]?[\n]|'
    r'Знания и навыки[?:]?[\n]|Обязательные навыки[?:]?[\n]|Ты идеальный кандидат, если у тебя есть[?:]?[\n]|Опыт и навыки[?:]?[\n]|Необходимые знания[?:]?[\n]|Требуемые навыки[?:]?[\n]|'
    r'Ваш профиль[?:]?[\n]|Желательно[?:]?[\n]|у Вас есть[?:]?[\n]|Потребуется[?:]?[\n]|Мы ищем кандидата, у которого есть[?:]?[\n]|'
    r'Что для этого понадобится  навыки и опыт[?:]?[\n]|Ожидания по опыту и навыкам успешного кандидата[?:]?[\n]|Кто нам нужен[?:]?[\n]|'
    r'Что хотим[?:]?[\n]|Что мы хотим видеть от Вас[?:]?[\n]|Что мы хотим увидеть[?:]?[\n]|Что важно для этой роли[?:]?[\n]|'
    r'Вы точно нам подходите, если вы уверенный специалист хотя бы в одной из этих областей[?:]?[\n]|Вы нам подходите, если[?:]?[\n]|'
    r'Наши пожелания[?:]?[\n]|Мы сработаемся, если есть[?:]?[\n]|Для выполнения задач необходимы[?:]?[\n]|'
    r'От вас нужно[?:]?[\n]|Мы ищем кандидата, который[?:]?[\n]|Ищем того, кто[?:]?[\n]|Мы будем рады рассмотреть вашу кандидатуру, если у вас есть[?:]?[\n]|'
    r'Мы подходим друг другу если у тебя есть[?:]?[\n]|Что команде хотелось бы видеть[?:]?[\n]|Что ждем от тебя[?:]?[\n]|'
    r'Квалификация[?:]?[\n]|Наш кандидат должен иметь[?:]?[\n]|Каким мы представляем нашего будущего коллегу[?:]?[\n]|Что важно для успеха в этой роли[?:]?[\n]|'
    r'Наши пожелания к квалификации[?:]?[\n]|Обязательные[?:]?[\n]|Мы абсолютно уверены, что ты справишься, ведь ты[?:]?[\n]|Ты — огонь, если[?:]?[\n]|'
    r'Мы ищем обладателя следующих знаний и навыков[?:]?[\n]|Что важно по опыту[?:]?[\n]|На какой опыт мы ориентируемся[?:]?[\n]|Технологии, которые нам интересны[?:]?[\n]|'
    r'Наш идеальный кандидат[?:]?[\n]|Ты нам подойдёшь, если[?:]?[\n]|Поэтому ищем того, кто[?:]?[\n]|Что мы ожидаем от тебя[?:]?[\n]|Какие навыки мы ожидаем[?:]?[\n]|'
    r'Технические навыки[?:]?[\n]|Используемые технологии[?:]?[\n]|Что необходимо[?:]?[\n]|Кого мы ищем[?:]?[\n]|Ты справишься с этим, если[?:]?[\n]|'
    r'Обязательные требования [(].*?[)][?:]?[\n]'
    
)

SECTION_WORKING_CONDITIONS_NAMES = (
    r'Предлагаем[?:]?[\n]|Мы предлагаем[?:]?[\n]|Что вас ждет после успешного обучения[?:]?[\n]|Процесс поиска[?:]?[\n]|Что мы готовы вам предложить[?:]?[\n]|'
    r'У нас[?:]?[\n]|Что ты получишь[?:][\n]?|Мы можем предложить[?:]?[\n]|Что мы предлагаем[?:]?[\n]|'
    r'Что предлагаем[?:]?[\n]|Еще несколько причин, почему именно мы[?:]?[\n]|Что тебя ждёт в[?:]?[\n]|В .* вас жд[её]т[?:]?[\n]|'
    r'Что компания может предложить[?:]?[\n]|Условия[?:]?[\n]|Наши условия[?:]?[\n]|Условия работы[?:]?[\n]|Про команду и рабочие процессы[?:]?[\n]|'
    r'Что ждать от нас[?:]?[\n]|С нас[?:]?[\n]|Что мы готовы предложить[?:]?[\n]|Что мы можем предложить[?:]?[\n]|Работа у нас - это[?:]?[\n]|Работа в .* это[?:]?[\n]|'
    r'Почему стоит выбрать нас[?:][\n]?|Вы гарантированно получите[?:]?[\n]|Что мы предлагаем взамен[?:]?[\n]|Что мы предлагаем для комфортной работы[?:]?[\n]|'
    r'Ну и самое приятное. Со своей стороны .* обещает с первых дней[?:]?[\n]|Со своей стороны .* обещает с первых дней[?:]?[\n]|'
    r'А ещё[?:]?[\n]|Что ты получаешь[?:]?[\n]|Что ты получишь, став частью нашей команды[?:]?[\n]|Условия и преимущества[?:]?[\n]|'
    r'Мы создаем среду, в которой ценят не только работу, но и заботу о сотрудниках[?:]?[\n]|Условия стажировки[?:]?[\n]|'
    r'Преимущества и возможности работы в нашей команде[?:]?[\n]|Условия и возможности[?:]?[\n]|Как сделаем жизнь комфортнее[?:]?[\n]|'
    r'Мы готовы предложить[?:]?[\n]|Что ты получишь с нами[?:]?[\n]|Мы предлагаем достойные условия работы[?:]?[\n]|С радостью предложим[?:]?[\n]|'
    r'#Киберплюшки для наших сотрудников[?:]?[\n]|Что получишь[?:]?[\n]|Условия и Бенефиты[?:]?[\n]'
)

KEYWORDS_END_OF_SECTIONS = (
    r'Технологический стек[?:]?[\n]|Наш стек[?:\n]?|Основной стек[?:\n]?|Стек технологий[?:]?[\n]|Мы используем современные инструменты[?:]?[\n]|Стек[?:]?[\n]|Стек[?:]?|'
    r'С нами классно работать[?:\n]?|Для разработки мы используем[?:]?[\n]|С чем ещё мы работаем[?:\n]?|'
    r'Ближайшие задачи[?:\n]?|Наши технологии[?:\n]?|Какие вещи и технологии мы используем в работе[?:\n]?|'
    r'Мы ожидаем уверенные знания[?:\n]?|В сопроводительном письме[?:\n]?|Знание технологий[?:\n]?|Почему .*[?:]?[\n]|'
    r'Архитектура и инфраструктура[?:\n]?|Глубокие технические компетенции[?:]?|Этапы входа в компанию[?:]?[\n]|Этапы отбора[?:]?[\n]|P.S.[\n]|'
    r'С уважением[?:\n]?|Добро пожаловать .*[?:\n]?|Одна из ценностей Evrone – работа с удовольствием[?:]?[\n]|Если вы готовы .*|Дополнительно о нас[?:\n]?|Чему вы научитесь[?:\n]?'
    r'Мы уверены, что вам понравится .*[?:\n]?|О команде[?:\n]?|Ключевые навыки[?:]?[\n]|Если интересно, напиши .*[?:]?|От HR кандидату[?:]?[\n]|'
    r'Если тебе откликается .*[?:\n]?|Жд[её]м отклик.*|Жд[её]м твоего отклика.*|Звучит как твой следующий шаг[?:\n]?|Присоединяйтесь к команде.*|Формат работы[?:\n]?|'
    r'Собеседование[?:]?[\n]|Перспективы[?:]?[\n]|Жд[её]м Ваши отклики.*|Одна из ценностей .*[?:]?[\n]|Основной язык программирования.*?[\n]'
)

def extract_duties_requirements_working_conditions_by_keywords(text):
    text = text.replace('\u200b', '').replace('<strong>', '').replace('</strong>', '').replace('<em>', '').replace('</em>', '').replace('<span>', '').replace('</span>', '').replace('—', '').replace('_', '').replace('·', '').replace('●', '')
    text = emoji.replace_emoji(text, replace="")
    soup = BeautifulSoup(text, 'html.parser')
    text = soup.get_text(separator='\n', strip=True)

    def extract_section(header_pattern, text, end_pattern):
        match = re.search(header_pattern + r'([\s\S]*?)(?=' + end_pattern + r'|$)', text, re.IGNORECASE | re.DOTALL)
        if match:
            return match.group(1).strip().replace(';', '').replace('-', '')
        return None

    duties = extract_section(
        r'(?:' + SECTION_DUTIES_NAMES + r')', 
        text, 
        r'\n(?:' + SECTION_REQUIREMENTS_NAMES + r'|' + SECTION_WORKING_CONDITIONS_NAMES + r'|' + KEYWORDS_END_OF_SECTIONS + r')'
    )
    requirements = extract_section(
        r'(?:' + SECTION_REQUIREMENTS_NAMES + r')', 
        text, 
        r'\n(?:' + SECTION_DUTIES_NAMES + r'|' + SECTION_WORKING_CONDITIONS_NAMES + r'|' + KEYWORDS_END_OF_SECTIONS + r')'
    )
    working_conditions = extract_section(
        r'(?:' + SECTION_WORKING_CONDITIONS_NAMES + r')',
        text, 
        r'\n(?:' + SECTION_DUTIES_NAMES + r'|' + SECTION_REQUIREMENTS_NAMES + r'|' + KEYWORDS_END_OF_SECTIONS + r')'
    )

    def extract_items(section_text):
        if not section_text:
            return []
        items = []
        for item in re.split(r'[•\n]', section_text):
            if item.strip():
                if item[0] in '-*':
                    symb = item[0]
                    item_with_removed_dash_at_start = item.strip().replace(symb, '', 1)
                    items.append(item_with_removed_dash_at_start)
                else:
                    items.append(item.strip())
        return items

    result = {
        'duties': extract_items(duties) if duties else [],
        'requirements': extract_items(requirements) if requirements else [],
        'working_conditions': extract_items(working_conditions) if working_conditions else []
    }

    return result


def get_payment_from_hh_vacancy(salary_data: dict | None):
    if salary_data == None:
        payment_from, payment_to = 0, 0
    else:
        payment_from = 0 if salary_data["from"] == None else salary_data["from"]
        payment_to = 0 if salary_data["to"] == None else salary_data["to"]
    return payment_from, payment_to